**packages for EDA**

- 1) Pandas: Data frame applications

- 2) Numpy: Numerical python all math applications

- 3) Matplotlib: used for Plotting

- 4) Seaborn: Also used for Plotting

- 5) Plotly: Used for Plotting

- 6) Bokhe: Used for Plotting

**Packages for Machine Learning**

- 7) sickit-learn: sklearn

**Packages for Deep Learning**

- 8) Tensorflow: Developed by Google

- 9) Keras     : Developed by Google

- 10) pytorch   : Developed by Facebook

**Packages for Natural Language Tool Kit**

- 11) NLKT : Natural langauge tool kit

- 12) scipy

**BERT**
  
- 13) Transformers : Hugging face(Google)

**Google Models**

- 14) Specific google packages

**Azure ML**

- 15) Azure Packages

**Gen AI**

- 16) Gemini : Google

- 17) ChatGPT : Open AI

**LangChain**

- 18) Langchain Packages

**Create a Dataframe using List**

- list to Dictionary
- Dictionary to list

**step-1: create a dataframe**

In [41]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

**step-2: provide the data**

In [45]:
names=['Ayush','Avinash','Akash']
pd.DataFrame(names)

         0
0    Ayush
1  Avinash
2    Akash

In [46]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age))

# first positional argument: data
# second positional argument: index

         0   1
0    Ayush  25
1  Avinash  30
2    Akash  35

In [64]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['Hyd','Blr','Mumbai']
data=zip(names,age,city)
pd.DataFrame(data)

         0   1       2
0    Ayush  25     Hyd
1  Avinash  30     Blr
2    Akash  35  Mumbai

**step-3:
provide the column**

In [60]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
pd.DataFrame(zip(names,age),
             columns=['Name','Age'])

      Name  Age
0    Ayush   25
1  Avinash   30
2    Akash   35

In [65]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
city=['Hyd','Blr','Mumbai']
cols=['Name','Age','city']
data=zip(names,age,city)
df=pd.DataFrame(data,columns=cols)

In [66]:
type(df)

pandas.core.frame.DataFrame

**step-4:**
**Add New Column**

In [ ]:
- if you want to add new column
- first you need to check the number of rows in already existed data
- for example in above the dataframe has 3 rows
- you need to create a new list with 3 rows
- that list equate to the dataframe

In [67]:
job=['DS','DE','CS']
df['job']=job
df

      Name  Age    city job
0    Ayush   25     Hyd  DS
1  Avinash   30     Blr  DE
2    Akash   35  Mumbai  CS

In [88]:
exp=[3,5,10,15]
df['exp']=exp
df

      Name  Age     city  exp
A    Ayush   35      Hyd    3
B  Avinash   40      Blr    5
C    Akash   45   Mumbai   10
D     Anvi   50  chennai   15

**step-5:
Update already existed column**

- create new column and update new column both are same

In [86]:
df['Age']=[35,40,45,50]
df

      Name  Age     city
A    Ayush   35      Hyd
B  Avinash   40      Blr
C    Akash   45   Mumbai
D     Anvi   50  chennai

**step-6:
How to change index**

In [89]:
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Mumbai','chennai']
cols=['Name','Age','city']
idx=['A','B','C','D']
data=zip(names,age,city)
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Name  Age     city
A    Ayush   25      Hyd
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [ ]:
**Note:**
  - Number of list equals to number of columns
  - number of values inside list equals to number of rows
  - when you create the data all the lists will be in same length

**step-7:
shape**

- number of rows
- number of columns

In [80]:
df.shape
#matrix format
# 4 rows and 3 columns
print('the number of rows are:',df.shape[0])
print('the number of columns are:',df.shape[1])

the number of rows are: 4
the number of columns are: 3

**step-8:
how to drop the columns**

- in order to drop column we require 3 argument

1) column name need to be mentioned
2) axis:
   - axis=0 (**represent rows**)
   - axis=1 (**represent column**)
   
3)inplace:

    - we drop column means we are modifying the data frame
    
    - so this modifications we want to save in same variable or different variable
    
    - if you want to keep in the same variable then **inplace=True**

In [81]:
df

      Name  Age     city
A    Ayush   25      Hyd
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [ ]:
df.drop('city',axis=1,inplace=True)

In [92]:
df

      Name  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [96]:
df1=df.drop('Age',axis=1)

In [97]:
df1

      Name
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [98]:
df

      Name  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [99]:
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Mumbai','chennai']
cols=['Name','Age','city']
idx=['A','B','C','D']
data=zip(names,age,city)
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Name  Age     city
A    Ayush   25      Hyd
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [100]:
df.drop('city',axis=1,inplace=True)
df

      Name  Age
A    Ayush   25
B  Avinash   30
C    Akash   35
D     Anvi   40

In [101]:
df.drop('Age',axis=1,inplace=True)
df

      Name
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [104]:
df2=df.drop('Name',axis=1,)
df2
#axis=False

Empty DataFrame
Columns: []
Index: [A, B, C, D]

In [105]:
df

      Name
A    Ayush
B  Avinash
C    Akash
D     Anvi

**step-9:
drop multiple columns**

In [107]:
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Mumbai','chennai']
cols=['Name','Age','city']
idx=['A','B','C','D']
data=zip(names,age,city)
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Name  Age     city
A    Ayush   25      Hyd
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [108]:
df.drop(['Age','city'],axis=1,inplace=True)
df

      Name
A    Ayush
B  Avinash
C    Akash
D     Anvi

**step-4:
drop the rows:**

In [110]:
names=['Ayush','Avinash','Akash','Anvi']
age=[25,30,35,40]
city=['Hyd','Blr','Mumbai','chennai']
cols=['Name','Age','city']
idx=['A','B','C','D']
data=zip(names,age,city)
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Name  Age     city
A    Ayush   25      Hyd
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [111]:
df.drop('city',axis=0,inplace=True)
df

KeyError: "['city'] not found in axis"

In [112]:
df.drop('A',axis=0,inplace=True)
df

      Name  Age     city
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

**step-11: 
How to save dataframe in Local**

- generally data frames are two types
- csv(comma seperated value)
- excel

In [114]:
df

      Name  Age     city
B  Avinash   30      Blr
C    Akash   35   Mumbai
D     Anvi   40  chennai

In [117]:
#file name=data
#extension=csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [119]:
df.to_excel('data2.xlsx')
df.to_excel('data3.xlsx',index=False)